sample/sample-app-android/charts/charts.dot
digraph {
  edge ["arrowhead"="normal","arrowtail"="none"]
  graph ["dpi"="100","fontsize"="30","layout"="dot","ranksep"="1.5","rankdir"="TB"]
  node ["style"="filled"]
  "Lib android" ["fillcolor"="lightgreen","shape"="none"]
  "Lib java" ["fillcolor"="orange","shape"="none"]
  "Lib kotlin jvm" ["fillcolor"="mediumorchid","shape"="none"]
  "Lib kotlin mp" ["fillcolor"="mediumslateblue","shape"="none"]
  "app android" ["fillcolor"="limegreen","penwidth"="3","shape"="box"]
  "Lib android" -> "Lib kotlin jvm" ["style"="dotted"]
  "Lib kotlin mp" -> "Lib android" ["style"="solid"]
  "Lib kotlin mp" -> "Lib java" ["style"="bold","color"="orange"]
  "Lib kotlin mp" -> "Lib kotlin jvm" ["style"="solid"]
  "app android" -> "Lib android" ["style"="dotted"]
  "app android" -> "Lib kotlin mp" ["style"="dotted"]
}
